---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemProfileLength
source: html/661c43bb-fef3-66a0-59a5-a0ddfc1fbefe.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemProfileLength Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemProfileLength { get; }
```